Revit 2027 API
SolidCurveIntersectionMode Enumeration
 Represents the types of results available for calculating the intersection between a solid and a curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum SolidCurveIntersectionMode
Public Enumeration SolidCurveIntersectionMode
public enum class SolidCurveIntersectionMode
type SolidCurveIntersectionMode
Members
Member name | Value | Description
CurveSegmentsInside | 0 |  The results will include only curve segments inside the solid volume. This also will include curve segments coincident with the face(s) of the volume.
CurveSegmentsOutside | 1 |  The results will include only curve segments outside the solid volume.
See Also
Reference
Autodesk.Revit.DB Namespace